#+TITLE： 硕士毕业论文日志
#+AUTHOR： 王勇
#+EMAIIL: yungwong.seu@gmail.com
#+STARTUP: indent

* 随笔
*** <2017-04-07 Fri>
今天折腾了开源的「思源宋体」字体，并将其设置为了 Spacemacs 默认的中文显示字体
相比于「微软雅黑」字体，「思源宋体」字体显得更为清淡，看起来更为舒服。

笔记本的键盘太破旧了，按着不舒服，以后要买一副机械键盘。

*** <2017-04-08 Sat>
上午初步勾勒了「论文主要工作」的内容，后续润色未完成。

论文的书写不是一蹴而就的，需要先将逻辑线描述出来（大纲），逻辑线带出关键点。
具体的关键点，自成一体，也需内部的逻辑线支撑。
当逻辑网明确后，用准确精简的文字具体介绍。

以「问题」为核心，清楚介绍研究工作要解决什么问题。
方法论：综述解决「问题」的现有研究方法，重点介绍自己采用的研究方法及其创新点。

看了 1998 年押井守监制的「攻壳机动队」，有很多的哲学思辨。

*** <2017-04-10 Mon>
今天让导师看论文被骂了，好像是我偷走了徐博的研究思路。
吕老师对优先权特别看重。

幸好我想到了开题报告里写了考虑龙卷风移动效应，
不然不知道被骂到什么时候。

先把东西做出来，即使粗糙一些也无所谓，做出成果投出去，
在论文审核的时候可以把问题做精细。

论文独创的方向很重要，可我觉得一个问题做深做精也很有价值啊。

吕老师说我形成了固定的思路，理解不了他的思路，本来每个人的思路就不一样啊。

*** <2017-04-13 Thu>
检查论文中错别字和表述不准确的地方。
在 Emacs 中检查单词的拼写是一项值得加入的功能。

* 大论文
** todo
*** DONE 摘要；论文主要工作；本章引言、小结
CLOSED: [2017-03-27 Mon 15:27]
章节引言主要是介绍目前的研究现状，可引用参考论文中的文章主要工作。

*** DONE 改写 _本课题主要研究内容_ 根据[[吕老师建议]]
CLOSED: [2017-04-10 Mon 18:15]
确定逻辑线，然后再把各个点介绍清楚。

*** DONE _总结与展望_
CLOSED: [2017-04-13 Thu 16:00]
总结基本是各章总结的汇总。
展望提出进一步研究需要考虑的问题。

*** DONE _ABSTRACT_ 摘要翻译
CLOSED: [2017-04-13 Thu 15:59]
中英文并非全部对应。
英文表述参考了英文文献。

*** DONE _绪论课题研究背景及意义_ 增加龙卷风介绍
CLOSED: [2017-04-14 Fri 11:05]
龙卷风介绍可以包含许多内容。

*** DONE _计算流体动力学基本理论_ 增加湍流模型
CLOSED: [2017-04-05 Wed 10:05]
:LOGBOOK:
CLOCK: [2017-04-05 Wed 09:55]--[2017-04-05 Wed 10:05] =>  0:10
:END:
介绍的是 k-\epsilon 模型，实际使用的是 k-\omega 模型。
需要补充 k-\omega 模型的介绍吗？

*** DONE _龙卷风数值模拟结果及其正确性验证_
CLOSED: [2017-04-05 Wed 15:57]
:LOGBOOK:
CLOCK: [2017-04-05 Wed 10:31]--[2017-04-05 Wed 10:56] =>  0:25
:END:
切向速度云图、切向速度径向变化图、风压云图 etc 增加与 Rankine 涡模型的对比 
重新绘制切向速度在轴向剖面、水平剖面的云图。
切向速度径向变化图增加与 Rankine 涡的对比。
重新绘制风压在轴向剖面、水平剖面的云图。

*** DONE 单向流固耦合方法介绍 
CLOSED: [2017-04-06 Thu 09:25]
参考论文中的介绍。
参考原来报告中单向流固耦合的介绍，略显简单（平时多写报告是很有用的）。

*** DONE _FSI 方法与规范方法的对比_ 增加结果分析
CLOSED: [2017-04-05 Wed 17:00]
增加了与小论文相同的结果分析，但看起来仍然较少。

*** DONE _输电塔结构动力时程分析_ 增加结果分析
CLOSED: [2017-04-06 Thu 15:58]
插图中文字过大，尝试将图片尺寸设为默认。
默认尺寸中图形中文字仍然偏大，思考如何能控制图片中文字的大小。
参考龙卷风动态作用的论文。
=考虑龙卷风动态效应需要叠加风场移动速度吗？=

*** DONE _致谢_
CLOSED: [2017-04-08 Sat 14:59]
感谢导师，设计院图纸
感谢同课题组同学
感谢朋友
感谢家人
感谢开源软件及其社区维护，emacs, latex, python

*** DONE _作者简介_ 
CLOSED: [2017-04-08 Sat 14:26]
要加入校庆论文吗？
个人介绍「成绩优秀」？

*** DONE 插入附录程序
CLOSED: [2017-04-06 Thu 15:57]
AucTeX 配合 minted 宏包和-shell-escape 编译选项插入程序代码。

*** DONE 增加文献引用
CLOSED: [2017-04-18 Tue 11:14]
主要在引言部分增加参考文献引用。

** 吕老师建议
:LOGBOOK:
CLOCK: [2017-03-27 Mon 21:40]--[2017-04-05 Wed 09:54] => 204:14
:END:
*** 本课题主要研究内容！
- 指出目前研究的不足之处，存在的主要问题。
- 针对目前研究的某个具体的不足之处，总结自己解决了什么问题，
  采取了什么技术路线（按重要程度排序，不一定按照实际的章节顺序）。
- 介绍 XX 理论 -> 应用 XX 理论解决 XX 问题。
  
** 吕老师建议二
- 论文主要工作「单向流固耦合方法」的提出没有严格因果关系。
- 重点为每章小结。
- 同课题组同届课题要尽量避开，不能剽窃别人的研究思路。 

** 论文主要工作 
输电塔结构是空间格构式塔架，其风荷载采用体型系数法确定存在如下缺点：
体型系数较难确定（杆件分布复杂、挡风效应 等）

本文采用单向流固耦合方法计算格构式塔架受到的龙卷风荷载，难点如下：
- 流场网格划分复杂；
- CFD 计算得到的风压施加到有限元模型；
- 模拟足尺龙卷风数值风场。

难点一：流场网格划分复杂
解决方法：仅将输电塔主体框架在 CFD 计算流域中建模。
理由：次要构件（如支撑等）截面尺寸较小，挡风效应较小，考虑以体型系数法计算风荷载。

难点二：CFD 计算得到的风压施加到有限元模型
解决方法：输电塔有限元模型采用梁单元，编制程序将 CFD 计算得到的风压转化为梁单元节点集中力
理由：采用壳单元模拟输电塔构件可较容易实现 CFD 风场风压映射到有限元网格，但这种方法计算量较大。

难点三：模拟足尺龙卷风数值风场
解决方法：通过比较龙卷风缩尺数值风场和实测风场引入长度相似比和速度相似比，并利用这两个相似比将缩尺风场改造成足尺风场（利用长度相似比将缩尺风场的计算流域放大；利用速度相似比将缩尺风场的入口风速放大）

为了比单向流固耦合方法进行比较，还介绍了利用规范中风荷载计算公式计算龙卷风荷载的方法

准静态响应，参数化分析

动态响应

** 盲审修改意见及论文修改
*** S005127-2
**** 对于 CFD 模拟结果与实测结果差别较大，二者的涡流比分别为 0.28 和 2.0，二者相比是否合适？
如果在 CFD 中模拟涡流比为 2.0 的风场，可能会出现多涡、漩涡脱离地面的现象，需要使用大涡模拟（LES）才能准确模拟风场结构，所需计算量较大。
本文为了与 Baker 试验（涡流比为 0.28）对比，且将计算规模控制在可操作的范围内，故选取涡流比为 0.28，模拟结果与实测风场有所偏差，但尚在可接受的范围内。

**** 第 3.5 节，未说明将 FSI 方法与哪国规范比较。
已说明为 FSI 方法与中国规范比较。

**** P21，应说明$Y^{+}$值对流场模拟的影响。
$Y^{+}值对流场边界中速度分布的一般性影响见图 2.5。
本文 CFD 模拟在网格生成阶段根据$Y^{+}$值小于 10 的条件进行了自适应网格划分。

*** S005127-1
**** 从论文摘要、第二章小结、第五章结论，你的写法全部是“发现当相似比取为 4000……”，给人的感觉是你发现的，而 P28 页第四行，明确提到参考文献[48]研究了……，图 2.16 也是该文献的，你的论文只是取长度相似比为该值 4000。
已将写法改为“根据文献取长度相似比为 4000”

**** 第三章结论中，你采用的单向流固耦合方法和规范方法计算结果对比，最大轴向力误差不超过 20%，最大位移误差不超过 30%，可以相互验证。验证了什么？规范方法是可靠的（保守的）？同时你采用的方法是准确的？
本文采用的单向流固耦合方法并不能说是准确的，因为只有梁柱等构件采用了该方法；支撑等构件采用的是类似规范的方法。这主要是为了减小网格划分的难度和计算量。
规范方法的确是偏于保守的，但实际根据规范进行设计过于保守，会造成资源的浪费。
故二者的对比只能验证两种方法具有一定的可对比性，至于实际设计如何操作，如何在规范方法的基础上进行修正，还需要进一步的研究  。

**** 第四章，平行、垂直两种工况下、塔顶动态峰值位移均超过 3.5 米，接近 4 米，基本上是第三章规范方法的两倍，而结论中没有提及，建议在结论中补充说明（是否能下结论：规范方法不安全？）
根据动态分析的结果似乎说明了仅仅根据规范方法进行准静态分析是不安全的。
但实际龙卷风在近距离平行或垂直经过输电塔的概率是极小的，考虑动态效应的计算也较为复杂。所以需要结合可靠度的理论利用动态响应的结果对根据规范方法的准静态结果进行修正。

* 小论文：龙卷风作用下大跨越输电塔结构的静态响应分析
** 结果分析
*** DONE 准备 0 度、45 度和 90 度分析工况；
单向流固耦合分析工况中，选择 30 度结果代替 0 度，选择 75 度结果代替 90 度。

*** DONE 选取关键构件单元编号
CLOSED: [2017-03-27 Mon 19:04]
利用 ANSYS Meshing 和 Named Selection 提取单元编号。
单元根据梁、柱、支撑和位置（base, mid, arm, etc.)分类，并选取 X 向和 Y 向。
提取的单元较多，故需要在每个典型位置选取一个单元作为代表。

*** DONE 后处理提取关键单元轴向内力
CLOSED: [2017-03-27 Mon 19:05]
利用*GET 命令提取各单元的轴向力。
#+BEGIN_SRC apdl
*GET,Par,ELEM,N,SMISC,Snum
#+END_SRC
编制 APDL 后处理程序，将选取单元的轴向压力写入 CSV 格式的文件。

选取的单元编号需要满足如下条件：
- 采用 FSI 和 CODE 方法计算的结果差别较小；
- 存在 45 度为危险工况的单元；
- 选取单元分别处于不同的位置和方向。
